'use client';

import React from "react";
import styles from "../../../styles/freelance/freelance.module.css";

const TermsPage = () => {
  return (
    <div className={styles.container}>
      <h2 className={styles.termsTitel}>شروط استخدام منصة شطب</h2>

      <div className={styles.termsContent}>
        <ol>
          <li>
            تُخلي المنصة مسؤوليتها الكاملة عن أي استخدام للمنصة في تنفيذ أعمال تشطيب لأماكن أو أنشطة تخالف الشريعة الإسلامية، مثل: النوادي الليلية وغيرها من أي ماكن لا ترضي الله عز وجل. ويُحظر استخدام المنصة في أي أعمال من هذا النوع.
          </li>
          <li>المسؤولية الكاملة تقع على صاحب الطلب عند اختيار منفذ الخدمة.</li>
          <li>عدم استخدام المنصة في طلبات غير حقيقية أو بغرض الإعلانات.</li>
          <li>الالتزام بتقديم معلومات دقيقة عن الخدمة المطلوبة والمكان.</li>
          <li>
            طلب صورة بطاقة شخصية من المنفذ قبل التنفيذ يُعد شرطًا أساسيًا للحفاظ على الأمان وطلب فيش إن أمكن خاصة مع الفنيين.
          </li>
          <li>
            عدم التواصل خارج المنصة لضمان الأمان إلا بعد التحقق من الجدية.
          </li>
          <li>
            المنصة غير مسؤولة عن أي اتفاقات مالية تتم بين الطرفين خارج نطاقها.
          </li>
        </ol>

        <p className={styles.termsPar}>
          يُرجى قراءة الشروط جيدًا قبل نشر أي طلب، وفي حال مخالفة أي بند من البنود السابقة، يحق لإدارة المنصة اتخاذ الإجراءات المناسبة.
        </p>
      </div>
    </div>
  );
};

export default TermsPage;
